Revit 2017 API
StructuralSectionStructuralTees Class
 Defines parameters for Structural Tees structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2015
Syntax
C#
public class StructuralSectionStructuralTees : StructuralSectionHotRolled
Visual Basic
Public Class StructuralSectionStructuralTees _
	Inherits StructuralSectionHotRolled
Visual C++
public ref class StructuralSectionStructuralTees : public StructuralSectionHotRolled
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionStructuralTees
See Also
StructuralSectionStructuralTees Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace